/* 7salary.c -- подсчет доходов и налогов с выбором тарифной ставки

Модифицируйте упражнение по программированию 8 из главы 7 так, чтобы пункты меню
помечались буквами, а не цифрами; для прекращения ввода используйте букву q
вместо цифры 5
*/
#include <stdio.h>
#define MRATE1 8.75					/* тарифные ставки */
#define MRATE2 9.33
#define MRATE3 10.00
#define MRATE4 11.20
#define HLIMIT 40					/* лимит учета времени */
#define MONEY1 (MRATE1 * HLIMIT)	/* доход */
#define TAXRATE1 0.15				/* тарифы налогообложения */
#define TAXRATE2 0.2
#define TAXRATE3 0.25
#define TLIMIT1 300					/* лимиты налогообложения */
#define TLIMIT2 (TLIMIT1 + 150)
#define TAX1 (TLIMIT1 * TAXRATE1)	/* сумма налогов */
#define TAX2 (TAX1 + TAXRATE2 * (TLIMIT2 - TLIMIT1))

void printhelp (void);
void taxcalc (float mrate);

int main(void)
{
	int choice;

	printhelp ();
	while ((choice = getchar ()) != EOF)
	{
		while (getchar () != '\n')
			;

		switch (choice) {
			case 'a' : taxcalc (MRATE1); break;
			case 'b' : taxcalc (MRATE2); break;
			case 'c' : taxcalc (MRATE3); break;
			case 'd' : taxcalc (MRATE4); break;
			case 'q' : return 0;
			default: printf ("Выберите вариант от a до d или q для выхода\n");
		}
		printhelp ();
	}

	return 0;
}

void printhelp (void)
{
	printf ("*********************************************************************\n");
	printf ("Введите букву, соответствуюцую желаемой тарифной ставке или действию:\n");
	printf ("a) $%.2f/ч\t\t\tb) $%.2f/ч\n", MRATE1, MRATE2);
	printf ("c) $%.2f/ч\t\t\td) $%.2f/ч\n", MRATE3, MRATE4);
	printf ("q) Выход\n");
	printf ("*********************************************************************\n");
}

void taxcalc (float mrate)
{
	int h;
	float salary;
	float tax;

	printf ("Введите количество отработанных часов за неделю.\n");
	scanf ("%d", &h);
	if (h <= HLIMIT)
		salary = mrate * h;
	else
		salary = MONEY1 + mrate * 1.5 * (h - HLIMIT);

	if (salary <= TLIMIT1)
		tax = salary * TAXRATE1;
	else if (salary <= TLIMIT2)
		tax = TAX1 + TAXRATE2 * (salary - TLIMIT1);
	else
		tax = TAX2 + TAXRATE3 * (salary - TLIMIT2);

	printf ("Начислено: %.2f\tНалоги: %.2f\tЧистая прибыль: %.2f\n",
			salary, tax, salary - tax);

	while (getchar () != '\n')
		;
}

/*
$ ./7salary 
*********************************************************************
Введите букву, соответствуюцую желаемой тарифной ставке или действию:
a) $8.75/ч                      b) $9.33/ч
c) $10.00/ч                     d) $11.20/ч
q) Выход
*********************************************************************
a
Введите количество отработанных часов за неделю.
30
Начислено: 262.50       Налоги: 39.38   Чистая прибыль: 223.12
*********************************************************************
Введите букву, соответствуюцую желаемой тарифной ставке или действию:
a) $8.75/ч                      b) $9.33/ч
c) $10.00/ч                     d) $11.20/ч
q) Выход
*********************************************************************
c
Введите количество отработанных часов за неделю.
30
Начислено: 300.00       Налоги: 45.00   Чистая прибыль: 255.00
*********************************************************************
Введите букву, соответствуюцую желаемой тарифной ставке или действию:
a) $8.75/ч                      b) $9.33/ч
c) $10.00/ч                     d) $11.20/ч
q) Выход
*********************************************************************
b
Введите количество отработанных часов за неделю.
30
Начислено: 279.90       Налоги: 41.99   Чистая прибыль: 237.91
*********************************************************************
Введите букву, соответствуюцую желаемой тарифной ставке или действию:
a) $8.75/ч                      b) $9.33/ч
c) $10.00/ч                     d) $11.20/ч
q) Выход
*********************************************************************
d
Введите количество отработанных часов за неделю.
30
Начислено: 336.00       Налоги: 52.20   Чистая прибыль: 283.80
*********************************************************************
Введите букву, соответствуюцую желаемой тарифной ставке или действию:
a) $8.75/ч                      b) $9.33/ч
c) $10.00/ч                     d) $11.20/ч
q) Выход
*********************************************************************
abc
Введите количество отработанных часов за неделю.
30
Начислено: 262.50       Налоги: 39.38   Чистая прибыль: 223.12
*********************************************************************
Введите букву, соответствуюцую желаемой тарифной ставке или действию:
a) $8.75/ч                      b) $9.33/ч
c) $10.00/ч                     d) $11.20/ч
q) Выход
*********************************************************************
q
*/