/* q4.c  -- среднее арифметическое с разным входящим потоком

Напишите программу, которая принимает ноль или один аргумент командной
строки. Если имеется один аргумент, он интерпретируется как имя файла.
Если аргумент не указан, то должен использоваться стандартный ввод (stdin).
Предположите, что ввод состоит целиком из чисел с плавающей точкой.
Программа должна вычислять и отображать среднее  арифметическое значение
для введенных чисел.
*/
#include <stdio.h>
#include <stdlib.h>

int main (int argc, char **argv)
{
	FILE *fp;
	double num, sum = 0.0;
	int c = 0;

	if (argc < 2) {
		fp = stdin;
		printf ("Вводите числа с плавающей точкой:\n");
	}
	else
		if ((fp = fopen (argv[1], "r")) == NULL) {
			puts ("Не удалось открыть указанный файл");
			exit (EXIT_FAILURE);
		}

	while (fscanf (fp, "%lf", &num) == 1) {
		sum += num;
		c++;
	}

	printf ("Полученное среднее арифметическое: %.2f\n", sum / (double) c);
	fclose (fp);

	return 0;
}

/*
$ ./q4 
Вводите числа с плавающей точкой:
33.33 22.22 11.11 stop
Полученное среднее арифметическое: 22.22

21:32 $ ./q4 q4_test.txt 
Полученное среднее арифметическое: 50.00
*/