/* zippo2.c  -- получение информации о массиве zippo с помощью переменной типа указателя */
#include <stdio.h>

int main (void)
{
	int zippo[4][2] = {{2, 4}, {6, 8}, {1, 3}, {5, 7}};
	int (*pz)[2];

	pz = zippo;

	printf ("   pz = %p,    pz + 1 = %p\n", pz, pz + 1);		/* адресация внешнего массива */
	printf ("pz[0] = %p, pz[0] + 1 = %p\n", pz[0], pz[0] + 1);	/* адресация внутреннего массива */
	printf ("  *pz = %p,   *pz + 1 = %p\n", *pz, *pz + 1);		/* равно значению выше */
	printf ("pz[0][0] = %d\n", pz[0][0]);				/* значение 1 элемента (вообще) */
	printf ("  *pz[0] = %d\n", *pz[0]);				/* равно значению выше */
	printf ("    **pz = %d\n", **pz);				/* равно значению выше */
	printf ("        pz[2][1] = %d\n", pz[2][1]);			/* значение 2 элемента 3 элемента внешнего массива */
	printf ("*(*(pz + 2) + 1) = %d\n", *(*(pz + 2) + 1));		/* равно значению выше */

	return 0;
}

/*
$ ./zippo2
   pz = 0x7ffd9fa96d30,    pz + 1 = 0x7ffd9fa96d38
pz[0] = 0x7ffd9fa96d30, pz[0] + 1 = 0x7ffd9fa96d34
  *pz = 0x7ffd9fa96d30,   *pz + 1 = 0x7ffd9fa96d34
pz[0][0] = 2
  *pz[0] = 2
    **pz = 2
        pz[2][1] = 3
*(*(pz + 2) + 1) = 3
*/