/* q3.c -- Вычислите каждое из следующих выражений */
#include <stdio.h>

int main(void)
{
	int x;
	float y;

	y = 30.0 / 4.0 * 5.0;		/* y = 37.50 */
	printf("y = %1.2f\n", y);
	y = 30.0 / (4.0 * 5.0);		/* y = 1.50 */
	printf("x = %1.2f\n", y);
	x = 30 / 4 * 5;				/* x = 35 -- 30 / 4 даст 7 (целочисленное деление) */
	printf("x = %d\n", x);
	y = 30 / 4.0 * 5;			/* y = 37.50 -- 30 / 4.0 даст 7.5 (результат приведен к типу float) */
	printf("x = %1.2f\n", y);
	y = 30 / 4 * 5.0;			/* y = 35.00 -- 30 / 4 даст 7 (целочисленное деление) */
	printf("x = %1.2f\n", y);

	return 0;
}

/*
$ ./q3
y = 37.50
x = 1.50
x = 35
x = 37.50
x = 35.00
*/