/* 1no_global.c  -- переписать программу без использования глобальных переменных */
#include <stdio.h>

void critic (void);

int main (void)
{
	int units;		/* необязательное повторное объявление */

	printf ("Сколько фунтов весит маленький бочонок масла?\n");
	scanf ("%d", &units);

	while (units != 56) {
		printf ("Вам не повезло. Попробуйте еще раз.\n");
		scanf ("%d", &units);
	}

	printf ("Вы знали это!\n");

	return 0;
}

/*
$ ./1no_global 
Сколько фунтов весит маленький бочонок масла?
45
Вам не повезло. Попробуйте еще раз.
78
Вам не повезло. Попробуйте еще раз.
56
Вы знали это!
*/