/* 2pe12-2b.c  -- составная часть программы расчета расхода бензина

Расход бензина обычно измеряется в милях на один галлон в США и в литрах
на 100 километров в Европе. Ниже приведена часть программы, которая предлагает
пользователю выбрать режим (метрический или американский), а затем выполняет
сбор данных и вычисляет расход топлива.

Пример вывода:

Введите 0 для метрического режима или 1 для американского режима: 0
Введите пройденное расстояние в километрах: 600
Введите объем израсходованного топлива в литрах: 78.8
Расход топлива составляет 13.13 литров на 100 км.
Введите 0 для метрического режима или 1 для американского режима (-1 для завершения): 1
Введите пройденное расстояние в милях: 434
Введите объем израсходованного топлива в галлонах: 12.7
Расход топлива составляет 34.2 мили на галлон.
Введите 0 для метрического режима или 1 для американского режима (-1 для завершения): -1
Программа завершена.
*/

/* компилировать вместе с 2pe12-2a.c */
#include <stdio.h>
#include "2pe12-2a.h"

int main (void)
{
	int mode;

	printf ("Введите 0 для метрического режима или 1 для американского режима: ");
	scanf ("%d", &mode);

	while (mode >= 0) {
		set_mode (mode);
		get_info ();
		show_info ();
		printf ("Введите 0 для метрического режима или 1 для американского режима");
		printf (" (-1 для завершения): ");
		scanf ("%d", &mode);
	}

	printf ("Программа завершена.\n");

	return 0;
}