/* 2pe12-2a.c  -- составная часть программы расчета расхода бензина

Реализуйте файл исходного кода 2pe12-2a.c, чтобы обеспечить работоспособность
программе. В файле исходного кода должны определяться три переменных с областью
видимости в пределах файла и внутренним связыванием:

- режим;
- расстояние;
- расход топлива.

Функция get_info() запрашивает ввод данных согласно выбранному режиму и сохраняет
ответы в переменных с областью видимости в пределах файла.
Функция show_info() вычисляет и отображает расход топлива на основе выбранного
режима.
Можете считать, что пользователь вводит только числовые значения.
*/
#include <stdio.h>
#include "2pe12-2a.h"

static int _mode;
static double distance;
static double consumption;

void set_mode (int mode)
{
	_mode = mode;
}

void get_info (void)
{
	if (_mode == 0) {
		printf ("Введите пройденное расстояние в километрах: ");
	}
	else {
		printf ("Введите пройденное расстояние в милях: ");
	}
	while (scanf ("%lf", &distance) != 1) {
		while (getchar () != '\n')		/* или scanf ("%*s"); */
			;
		printf ("Введите число, такое как 2.88 или 3.56e4\n");
	}

	if (_mode == 0) {
		printf ("Введите объем израсходованного топлива в литрах: ");
	}
	else {
		printf ("Введите объем израсходованного топлива в галлонах: ");
	}
	while (scanf ("%lf", &consumption) != 1) {
		while (getchar () != '\n')		/* или scanf ("%*s"); */
			;
		printf ("Введите число, такое как 2.88 или 3.56e4\n");
	}
}

void show_info (void)
{
	if (_mode == 0) {
		printf ("Расход топлива составляет %.2f литров на 100 км.\n",
			100.0 * consumption / distance);
	}
	else {
		printf ("Расход топлива составляет %.2f мили на галлон.\n",
			distance / consumption);
	}
}
/*
$ ./2pe12-2 
Введите 0 для метрического режима или 1 для американского режима: 0
Введите пройденное расстояние в километрах: 150
Введите объем израсходованного топлива в литрах: 18.23
Расход топлива составляет 12.15 литров на 100 км.
Введите 0 для метрического режима или 1 для американского режима (-1 для завершения): 1
Введите пройденное расстояние в милях: 89.76
Введите объем израсходованного топлива в галлонах: 3.16
Расход топлива составляет 28.41 мили на галлон.
Введите 0 для метрического режима или 1 для американского режима (-1 для завершения): -1
Программа завершена.
*/