/* 2pe12-2b.c  -- составная часть программы расчета расхода бензина

Реализуйте файл исходного кода 3pe12-2a.c, чтобы обеспечить работоспособность
программе. Используйте только автоматические переменные.

Обеспечьте программе тот же самый пользовательйский интерфейс, т.е. она должна
предлагать пользователю ввести режим и т.д. Однако у вас будет другой набор
вызовов функций.

Можете считать, что пользователь вводит только числовые значения.
*/
#include <stdio.h>
#include "3pe12-2a.h"

void get_info (int mode, double *distance, double *consumption)
{
	if (mode == 0) {
		printf ("Введите пройденное расстояние в километрах: ");
	}
	else {
		printf ("Введите пройденное расстояние в милях: ");
	}
	while (scanf ("%lf", distance) != 1) {
		while (getchar () != '\n')		/* или scanf ("%*s"); */
			;
		printf ("Введите число, такое как 2.88 или 3.56e4\n");
	}

	if (mode == 0) {
		printf ("Введите объем израсходованного топлива в литрах: ");
	}
	else {
		printf ("Введите объем израсходованного топлива в галлонах: ");
	}
	while (scanf ("%lf", consumption) != 1) {
		while (getchar () != '\n')		/* или scanf ("%*s"); */
			;
		printf ("Введите число, такое как 2.88 или 3.56e4\n");
	}
}

void show_info (int mode, double *distance, double *consumption)
{
	if (mode == 0) {
		printf ("Расход топлива составляет %.2f литров на 100 км.\n",
			100.0 * *consumption / *distance);
	}
	else {
		printf ("Расход топлива составляет %.2f мили на галлон.\n",
			*distance / *consumption);
	}
}
/*
$ ./3pe12-2 
Введите 0 для метрического режима или 1 для американского режима: 0
Введите пройденное расстояние в километрах: 150
Введите объем израсходованного топлива в литрах: 18.23
Расход топлива составляет 12.15 литров на 100 км.
Введите 0 для метрического режима или 1 для американского режима (-1 для завершения): 1
Введите пройденное расстояние в милях: 89.76
Введите объем израсходованного топлива в галлонах: 3.16
Расход топлива составляет 28.41 мили на галлон.
Введите 0 для метрического режима или 1 для американского режима (-1 для завершения): -1
Программа завершена.
*/