/* 6rand_stat.c  -- статистика генерации случайных чисел (проверка детерминированности)

Напишите программу, которая генерирует 1000 случайных чисел в диапазоне от 1 до 10.
Не сохраняйте и не выводите эти числа, а выводите лишь то, сколько раз генерировалось
каждое число. Программа должна делать это для 10 разных начальных значений. Появляются
ли числа в одинаковых количествах? Можете использовать функции из этой главы или функции
rand() и srand() из ANSI C, которые следуют тому же формату, что и рассмотренные здесь.
Это один из способов исследования недетерминированности конкретного генератора случайных
чисел.
*/
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#define LIM 10		/* максимальное количество читаемых строк */
#define NUMS 1000	/* количество генерируемых чисел */

void gen_and_stat ();

int main (void)
{
	int i;
	time_t start = time (NULL);

	for (i = 0; i < LIM; i++) {
		srand (start + i);
		gen_and_stat ();
	}

	return 0;
}

/* Сортируем числа по убыванию */
void gen_and_stat ()
{
	static int a[LIM];
	int b[LIM] = {0};
	static int calls = 1;
	int i;

	/* Наивный подсчет во время генерации */
	for (i = 0; i < NUMS; i++) {
		switch ((rand () % LIM) + 1) {
		case 1:
			a[0]++;
			b[0]++;
			break;
		case 2:
			a[1]++;
			b[1]++;
			break;
		case 3:
			a[2]++;
			b[2]++;
			break;
		case 4:
			a[3]++;
			b[3]++;
			break;
		case 5:
			a[4]++;
			b[4]++;
			break;
		case 6:
			a[5]++;
			b[5]++;
			break;
		case 7:
			a[6]++;
			b[6]++;
			break;
		case 8:
			a[7]++;
			b[7]++;
			break;
		case 9:
			a[8]++;
			b[8]++;
			break;
		case 10:
			a[9]++;
			b[9]++;
			break;
		}
	}

	/* Красивый но теоретически в ~10+ раз более медленный подсчет и еще нужно хранение */
	// for (i = 0; i < LIM; i++)
	// 	for (int k = 0; k < NUMS; k++)
	// 		if (i + 1 == nums[k]) {
	// 			a[i]++;
	// 			b[i]++;
	// 		}

	printf ("Run %d:", calls);

	for (i = 0; i < LIM; i++)
		printf ("\t%d:%5d", i + 1, b[i]);

	printf ("\n");
	printf ("Full:");

	for (i = 0; i < LIM; i++)
		printf ("\t%d:%5d", i + 1, a[i]);

	printf ("\n\n");
	calls++;
}
/*
$ ./6rand_stat 
Run 1:  1:   98 2:   77 3:  105 4:  124 5:   84 6:  110 7:  102 8:  102 9:  101 10:   97
Full:   1:   98 2:   77 3:  105 4:  124 5:   84 6:  110 7:  102 8:  102 9:  101 10:   97

Run 2:  1:  100 2:   84 3:   89 4:  107 5:   93 6:  111 7:  101 8:  101 9:  117 10:   97
Full:   1:  198 2:  161 3:  194 4:  231 5:  177 6:  221 7:  203 8:  203 9:  218 10:  194

Run 3:  1:  119 2:   74 3:  112 4:   97 5:  103 6:  114 7:   97 8:  103 9:   93 10:   88
Full:   1:  317 2:  235 3:  306 4:  328 5:  280 6:  335 7:  300 8:  306 9:  311 10:  282

Run 4:  1:   93 2:  103 3:  102 4:   98 5:  100 6:   74 7:  105 8:  114 9:  105 10:  106
Full:   1:  410 2:  338 3:  408 4:  426 5:  380 6:  409 7:  405 8:  420 9:  416 10:  388

Run 5:  1:  100 2:   94 3:  114 4:  114 5:  118 6:  101 7:   74 8:   88 9:   96 10:  101
Full:   1:  510 2:  432 3:  522 4:  540 5:  498 6:  510 7:  479 8:  508 9:  512 10:  489

Run 6:  1:   98 2:  105 3:  121 4:  107 5:  107 6:   85 7:   95 8:   97 9:   96 10:   89
Full:   1:  608 2:  537 3:  643 4:  647 5:  605 6:  595 7:  574 8:  605 9:  608 10:  578

Run 7:  1:   96 2:  123 3:   94 4:  109 5:   90 6:  102 7:   98 8:   83 9:  100 10:  105
Full:   1:  704 2:  660 3:  737 4:  756 5:  695 6:  697 7:  672 8:  688 9:  708 10:  683

Run 8:  1:  114 2:  109 3:  108 4:   86 5:   94 6:  110 7:   93 8:   98 9:   89 10:   99
Full:   1:  818 2:  769 3:  845 4:  842 5:  789 6:  807 7:  765 8:  786 9:  797 10:  782

Run 9:  1:  107 2:  105 3:  108 4:   89 5:   97 6:   99 7:   90 8:  109 9:  104 10:   92
Full:   1:  925 2:  874 3:  953 4:  931 5:  886 6:  906 7:  855 8:  895 9:  901 10:  874

Run 10: 1:  102 2:  112 3:   87 4:  111 5:   98 6:   93 7:   88 8:   94 9:  114 10:  101
Full:   1: 1027 2:  986 3: 1040 4: 1042 5:  984 6:  999 7:  943 8:  989 9: 1015 10:  975
*/