/* 6rand_stat.c  -- статистика генерации случайных чисел (проверка детерминированности)

Напишите программу, которая генерирует 1000 случайных чисел в диапазоне от 1 до 10.
Не сохраняйте и не выводите эти числа, а выводите лишь то, сколько раз генерировалось
каждое число. Программа должна делать это для 10 разных начальных значений. Появляются
ли числа в одинаковых количествах? Можете использовать функции из этой главы или функции
rand() и srand() из ANSI C, которые следуют тому же формату, что и рассмотренные здесь.
Это один из способов исследования недетерминированности конкретного генератора случайных
чисел.
*/
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#define LIM 10		/* максимальное количество читаемых строк */
#define NUMS 1000	/* количество генерируемых чисел */

void gen_and_stat ();

int main (void)
{
	int i;
	time_t start = time (NULL);

	for (i = 0; i < LIM; i++) {
		srand (start + i);
		gen_and_stat ();
	}

	return 0;
}

/* Сортируем числа по убыванию */
void gen_and_stat ()
{
	static int a1, a2, a3, a4, a5, a6, a7, a8, a9, a10;
	int b1 = 0, b2 = 0, b3 = 0, b4 = 0, b5 = 0;
	int b6 = 0, b7 = 0, b8 = 0, b9 = 0, b10 = 0;
	static int calls = 1;
	int i;

	for (i = 0; i < NUMS; i++) {
		switch ((rand () % 10) + 1) {
		case 1:
			a1++;
			b1++;
			break;
		case 2:
			a2++;
			b2++;
			break;
		case 3:
			a3++;
			b3++;
			break;
		case 4:
			a4++;
			b4++;
			break;
		case 5:
			a5++;
			b5++;
			break;
		case 6:
			a6++;
			b6++;
			break;
		case 7:
			a7++;
			b7++;
			break;
		case 8:
			a8++;
			b8++;
			break;
		case 9:
			a9++;
			b9++;
			break;
		case 10:
			a10++;
			b10++;
			break;
		}
	}

	printf ("Run %d:\t1:%5d\t2:%5d\t3:%5d\t4:%5d\t5:%5d\t6:%5d\t7:%5d\t8:%5d\t9:%5d\t10:%5d\n",
		calls, b1, b2, b3, b4, b5, b6, b7, b8, b9, b10);
	printf ("Full:\t1:%5d\t2:%5d\t3:%5d\t4:%5d\t5:%5d\t6:%5d\t7:%5d\t8:%5d\t9:%5d\t10:%5d\n\n",
		a1, a2, a3, a4, a5, a6, a7, a8, a9, a10);
	calls++;
}
/*
$ ./6rand_stat 
Run 1:  1:   93 2:  104 3:  113 4:  106 5:   95 6:   98 7:   89 8:  108 9:   98 10:   96
Full:   1:   93 2:  104 3:  113 4:  106 5:   95 6:   98 7:   89 8:  108 9:   98 10:   96

Run 2:  1:  100 2:  101 3:  121 4:  120 5:   90 6:   83 7:   88 8:  107 9:   86 10:  104
Full:   1:  193 2:  205 3:  234 4:  226 5:  185 6:  181 7:  177 8:  215 9:  184 10:  200

Run 3:  1:   97 2:   86 3:  104 4:  102 5:  104 6:  112 7:  111 8:   99 9:   94 10:   91
Full:   1:  290 2:  291 3:  338 4:  328 5:  289 6:  293 7:  288 8:  314 9:  278 10:  291

Run 4:  1:  101 2:   98 3:  113 4:  106 5:   94 6:  103 7:   96 8:  100 9:   97 10:   92
Full:   1:  391 2:  389 3:  451 4:  434 5:  383 6:  396 7:  384 8:  414 9:  375 10:  383

Run 5:  1:   95 2:   85 3:   97 4:   90 5:  111 6:  103 7:  111 8:  109 9:  101 10:   98
Full:   1:  486 2:  474 3:  548 4:  524 5:  494 6:  499 7:  495 8:  523 9:  476 10:  481

Run 6:  1:  102 2:  102 3:  102 4:  110 5:   93 6:   99 7:   93 8:   94 9:  110 10:   95
Full:   1:  588 2:  576 3:  650 4:  634 5:  587 6:  598 7:  588 8:  617 9:  586 10:  576

Run 7:  1:  114 2:   97 3:   97 4:  102 5:   99 6:  110 7:   97 8:   94 9:  107 10:   83
Full:   1:  702 2:  673 3:  747 4:  736 5:  686 6:  708 7:  685 8:  711 9:  693 10:  659

Run 8:  1:   98 2:   82 3:   99 4:   99 5:  107 6:  103 7:   99 8:  113 9:   91 10:  109
Full:   1:  800 2:  755 3:  846 4:  835 5:  793 6:  811 7:  784 8:  824 9:  784 10:  768

Run 9:  1:   92 2:  114 3:   99 4:   86 5:   92 6:  110 7:  104 8:  105 9:   94 10:  104
Full:   1:  892 2:  869 3:  945 4:  921 5:  885 6:  921 7:  888 8:  929 9:  878 10:  872

Run 10: 1:   88 2:   95 3:   96 4:  103 5:  100 6:   98 7:   93 8:  108 9:  115 10:  104
Full:   1:  980 2:  964 3: 1041 4: 1024 5:  985 6: 1019 7:  981 8: 1037 9:  993 10:  976
*/