/* 7diceroll.c  -- броски кубика. Компилировать вместе с 7manydice.c

Напишите программу, которая ведет себя подобно модификации листинга 12.13, которая
обсуждалась после представления вывода из программы, показанной в листинге 12.13.
То есть программа должна давать вывод следующего вида:

Введите количество бросков или q для завершения: 18
Сколько граней и сколько костей? 6 3
Имеем 18 бросков 3 костей с 6 гранями.
  12  10   6   9   8  14   8  15   9  14  12  17  11   7  10  13   8  14
Введите количество бросков или q для завершения: q
*/
#include <stdio.h>
#include <stdlib.h>		/* rand() */
#include "7diceroll.h"		/* наш заголовочный файл, искать локально */

static int rollem (int sides)	/* доступна только в данном файле */
{
	int roll;

	roll = rand () % sides + 1;

	return roll;
}

int roll_n_dice (int dice, int sides)
{
	int d;
	int total = 0;

	if (sides < 2) {
		printf ("Требуются, по меньшей мере, 2 грани.\n");

		return -2;
	}
	if (dice < 1) {
		printf ("Требуется, по меньшей мере, 1 кость.\n");

		return -1;
	}

	for (d = 0; d < dice; d++)
		total += rollem (sides);

	return total;
}
