/* 7manydice.c  -- бросание множества костей. Компилировать вместе с 7diceroll.c

Напишите программу, которая ведет себя подобно модификации листинга 12.13, которая
обсуждалась после представления вывода из программы, показанной в листинге 12.13.
То есть программа должна давать вывод следующего вида:

Введите количество бросков или q для завершения: 18
Сколько граней и сколько костей? 6 3
Имеем 18 бросков 3 костей с 6 гранями.
  12  10   6   9   8  14   8  15   9  14  12  17  11   7  10  13   8  14
Введите количество бросков или q для завершения: q
*/
#include <stdio.h>
#include <stdlib.h>		/* srand() */
#include <time.h>		/* time() */
#include "7diceroll.h"		/* наш заголовочный файл, искать локально */
				/* для функции roll_n_dice() */

int main (void)
{
	int throws, sides, dice_count;
	int status;
	int i;

	srand ((unsigned int) time (0));	/* рандомизация начального числа */
	printf ("Введите количество бросков или q для завершения программы: ");

	while (scanf ("%d", &throws) == 1) {
		printf ("Сколько граней и солько костей?\n");
		if ((status = scanf ("%d %d", &sides, &dice_count)) != 2) {
			if (status == EOF)
				break;		/* ранний выход из цикла */
			else {
				printf ("Вы должны ввести целые числа.");
				printf ("Давайте начнем сначала.\n");

				while (getchar() != '\n')
					continue;	/* отбросить некорректный вывод */

				printf ("Сколько граней и солько костей?\n");
				continue;	/* новая итерация цикла */
			}
		}

		u_int rolls[throws];

		printf ("Имеем %d бросков %d костей с %d гранями.\n",
			throws, dice_count, sides);

		for (i = 0; i < throws; i++) {
			rolls[i] = roll_n_dice (dice_count, sides);
			printf ("%3u ", rolls[i]);
		}
		printf ("\n");
		printf ("Введите количество бросков или q для завершения программы: ");
	}

	return 0;
}
/*
$ ./7manydice 
Введите количество бросков или q для завершения программы: 15
Сколько граней и солько костей?
20 1
Имеем 15 бросков 1 костей с 20 гранями.
 20  17  17   3   5   8  16  19  20  13  11  18   4   5  10 
Введите количество бросков или q для завершения программы: 5
Сколько граней и солько костей?
6 4
Имеем 5 бросков 4 костей с 6 гранями.
 22  15  18  11  13 
Введите количество бросков или q для завершения программы: q
*/