/* sweetie2.c -- цикл for со счетчиком */
#include <stdio.h>

int main(void)
{
	const int NUMBER = 22;
	int count;

	for (count = 1; count <= NUMBER; count++)
		printf ("Будь моим другом!\n");

	return 0;
}

/*
$ ./sweetie2
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
Будь моим другом!
*/